# Итоговая проверочная работа

## Задача:
*Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.*

- ## Описание решения задачи:
1. Объявление массива 1 (string [] array1 = new string [4];);
2. Инициализация массива 1
(array1[0] = "1234";
array1[1] = "1567";
array1[2] = "-2";
array1[3] = "computer scince";);
3. Вывод данных массива 1
(Console.WriteLine("Изначальный массив: " + array1[0] + ", " + array1[1] + ", " + array1[2] + ", " + array1[3]););
4. Создание цикла для того, чтобы определить элементы массива, длина которых меньше, либо равна 3
(for (int i = 0; i < array1.Length; i++)
{
if(array1[i].Length <= 3)
newLength++;
});
5. Объявление массива 2 (string [] array2 = new string [newLength];);
6. Создание цикла для массива 2
(for (int i = 0; i < array1.Length; i++)
{
if(array1[i].Length <= 3)
{
array2[counter] = array1[i];
counter++;
}
})
7. Вывод сформированного массива
(Console.WriteLine("Сформированный массив: ");
for (int i = 0; i < array2.Length; i++)
{
Console.Write(array2[i] + " ");
}
Console.WriteLine();)

- ## Файл с описанием решения *Задачи* находится в папке "Task" => файл "Program.cs".

- ## Блок-схема алгоритма находится в файле "block_diagram.drawio".
